---
title: DuctFailures
classe: Autodesk.Revit.DB.BuiltInFailures+DuctFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# DuctFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotCreateGeometryForDuct { get; }` | `DuctFailures.CannotCreateGeometryForDuct` | FailureDefinitionId |
| `FailureDefinitionId FlexDuctLengthOutOfLimits { get; }` | `DuctFailures.FlexDuctLengthOutOfLimits` | FailureDefinitionId |
| `FailureDefinitionId NoDuctFittingsInProject { get; }` | `DuctFailures.NoDuctFittingsInProject` | FailureDefinitionId |
| `FailureDefinitionId PartNotFoundDueToNoDuctConnectedError { get; }` | `DuctFailures.PartNotFoundDueToNoDuctConnectedError` | FailureDefinitionId |
| `FailureDefinitionId PartNotFoundDueToNoDuctConnectedWarning { get; }` | `DuctFailures.PartNotFoundDueToNoDuctConnectedWarning` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```